---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotSolveRebarShapeUsingDataFromDimension
source: html/c7801d9b-fa6e-0109-26b6-6bcc52134720.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotSolveRebarShapeUsingDataFromDimension Property

Cannot solve rebar shape using the current constraints.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSolveRebarShapeUsingDataFromDimension { get; }
```